Tekla.Structures.ModelInternal.Operation.dotBeamPositioningBox
Beam (section) positioning box.

Tekla.Structures.ModelInternal.Operation.dotBeamPositioningBox.Height
Box height (section size in beam local Y)

Tekla.Structures.ModelInternal.Operation.dotBeamPositioningBox.Width
Box width (section size in beam local Z)